user_details/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "confirm_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	@user=User.new(user_params)
  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
  	@user=User.find(params[:id])
  	@user.delete